DenisCosmin21/RTOS/GCC_STM32CubeIDE/RTOS/Src/timebase.c
#include "timebase.h"
#include "stm32u5xx.h"

#define ONE_SEC_LOAD 4000000UL
#define TICK_HZ 1000
#define ONE_MS_LOAD (ONE_SEC_LOAD / TICK_HZ)


#define CTRL_ENABLE (1U<<0)
#define CTRL_CLCKSRC (1U<<2)
#define CTRL_TICKINT (1U<<1)
#define CTRL_COUNTFLAG	(1<<16)


#define MAX_DELAY  0xFFFFFFFFU

volatile uint32_t g_curr_tick;
volatile uint32_t g_curr_tick_p;
volatile uint32_t tick_freq = 1;

uint32_t get_tick(void);


void delay(uint32_t delay)
{
	uint32_t tickstart = get_tick();
	uint32_t wait =  delay;
	while(get_tick() - tickstart < wait){}
}

void tick_increment(void){
	g_curr_tick += tick_freq;
}

uint32_t get_tick(void)
{
	__disable_irq();
	g_curr_tick_p = g_curr_tick;
	__enable_irq();


	return g_curr_tick_p;
}

void timebase_init(void)
{
	/*Reload the timer with number of cycles per second*/
	SysTick->LOAD = ONE_SEC_LOAD - 1;
	/*Clear Systick current value register*/
	SysTick->VAL = 0;

	/*Enable ICS*/
	SysTick->CTRL =  CTRL_CLCKSRC;

	/*Ennble interrupt*/
	SysTick->CTRL |= CTRL_TICKINT;

	/*Enable Systick*/
	SysTick->CTRL |= CTRL_ENABLE;

	/*Enable global inteeruupts*/
	__enable_irq();
}

